thesis_guidelines.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-01-25 Mon 11:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Thesis Guidelines</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Christoph Schottmüller" />
</head>
<body>
<div id="content">
<h1 class="title">Thesis Guidelines</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline3">1. Finding a topic</a>
<ul>
<li><a href="#orgheadline1">1.1. Most common thesis types (I supervise)</a></li>
<li><a href="#orgheadline2">1.2. Is my topic (candidate) appropriate for a thesis?</a></li>
</ul>
</li>
<li><a href="#orgheadline4">2. Writing a proposal</a></li>
<li><a href="#orgheadline5">3. Supervision</a></li>
<li><a href="#orgheadline6">4. Writing</a></li>
<li><a href="#orgheadline7">5. Some general remarks</a></li>
<li><a href="#orgheadline8">6. Useful sources for how to write/model</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">1</span> Finding a topic</h2>
<div class="outline-text-2" id="text-1">
<p>
The most important part is that you are interested in your topic. After all you will spend a couple of months with it. You can draw on many sources in order to find a topic:
</p>
<ul class="org-ul">
<li>the news. Some economic or political problem might pop up that you find interesting. Magazines with somewhat longer articles (like the Economist or the New Yorker) could be especially helpful.</li>
<li>your student job. Your job might give you a lot of background and inside information on certain questions which gives you a head start when analyzing.</li>
<li>your hobbies. You are an avid stamp collector and want to write about some interesting features of the market for stamps? Why not?</li>
<li>books; and I do not necessarily mean textbooks. I had the idea for a paper of mine while reading the description of Bentham's panopticon in a book that had nothing to do with economics. When reading the description I realized that this was a strategic problem that would merit some game theoretic modeling.</li>
<li>academic papers. Analyzing a variation of a published paper is a good approach for a thesis. Survey articles as published in <i>Journal of Economic Literature, /Journal of Economic Perspectives</i>, Elsevier's <i>Handbook of &#x2026;</i> series and also the <i>New Palgrave Dictionary of Economics</i> might give you a decent background on a topic in any case.</li>
<li>policy and legal documents. An economic analysis of certain proposals (or decisions in competition policy cases) can make an interesting thesis.</li>
<li>your course work. However, students tend to over-rely on this last channel.</li>
</ul>

<p>
You also might keep in mind what you want to do after your studies. Your thesis can be an entry ticket into a certain kind of career/sector, e.g. future employer might be more inclined to interview you if they can see that you wrote a thesis on a topic that is relevant to them.
</p>
</div>

<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Most common thesis types (I supervise)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The following list is not exhaustive but if you have something different in mind we should talk about it first.
</p>

<ul class="org-ul">
<li>you pick a topic, e.g. from the news, you find interesting and analyze it using a game-theoretical model (some computational or empirical parts are, of course, fine as well; however, I won't be much use in procuring the data for empirical analysis).</li>
<li>you start from a published model and change some assumption or introduce an additional variable (or use a different solution concept). Then solve the model and compare your solution to the one in the paper. What (additional) effects emerge? Are the results in the paper robust?</li>
<li>you analyze a competition policy decision. This will usually be a decision by DG Comp, the General Court ( formerly known as Court of First Instance) or the European Court of Justice. You check whether the reasoning in the decision makes economic sense by modeling the reasoning using models from IO, game theory and contract theory. (Please, note that the definition of the relevant market takes usually a lot more space in these decisions than it should in your thesis.)</li>
<li>comparative literature survey. This is usually not the first choice because it is very difficult to do this properly. The idea is that you show why different results are obtained in different papers and how this depends on their assumptions. Hence, you try not to summarize one paper after another but to explain the logic underlying a whole literature.<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Is my topic (candidate) appropriate for a thesis?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
After identifying a potential topic you should ask yourself "Can I make this into a thesis?" Microeconomic modeling is to a large extent simply a way to tell a story about trade-offs. Consequently, you should ask yourself the following questions:
</p>
<ul class="org-ul">
<li>what is the story?</li>
<li>who are the players?
<ul class="org-ul">
<li>what is their information?</li>
<li>what are their actions?</li>
</ul></li>
<li>what trade-offs do players face?</li>
<li>what strategic effects may result; how do players respond strategically to other players</li>
<li>is there a simple framework in which I can capture this story/trade-off/strategic effect?</li>
<li>is there the potential to learn something new?</li>
<li>what could be a possible result/conclusion of the thesis? (it will eventually be very different, but to formulate a possible result helps you to see what kind of things you might strive for and whether the topic is sufficiently rich for a thesis)</li>
<li>can you explain to your friends why this is a good thesis topic?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">2</span> Writing a proposal</h2>
<div class="outline-text-2" id="text-2">
<p>
When you have thought through the questions above, you write up a one page research proposal (summing up your thoughts/answers) and send this proposal to me. I will read it and then we meet to discuss the proposal (or I refer you to a colleague of mine if your proposal is completely out of my own field of expertise). We might conclude that the proposal should be changed a bit or we might immediately go ahead and make the thesis contract, talk about a rough schedule etc.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">3</span> Supervision</h2>
<div class="outline-text-2" id="text-3">
<p>
I do not have a fixed format for supervision as the needs will differ from thesis to thesis. However, there is some minimum structure that applies generally:
</p>
<ul class="org-ul">
<li>I want to see a proposal (~1 page); preferably before meeting for the first time. (If we meet before you have a proposal, I usually cannot tell you much more than is written in this document.) I will not sign a thesis contract if you do not have a proposal because I feel that it would be irresponsible to let you commit to something without having any idea of what to do.</li>
<li>We have a midterm review to take stock and to see how you are doing on time.</li>
</ul>

<p>
I know it is very tempting to ask your supervisor all the time what to do next. However, keep in mind that a thesis is an <i>independent</i> piece of work and the novelty of <i>your ideas</i> is part of the evaluation.
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">4</span> Writing</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Have a clear structure.</li>
<li>Use a consistent citation style. Economists mainly use the <i>author (year)</i> style.</li>
<li>Use the <i>proposition-proof</i> style; i.e. state a result formally in a proposition (or lemma or theorem), explain it intuitively in the main text and add a formal proof (possibly in an appendix).</li>
<li>Include a literature section where you place your thesis in the related literature. Google Scholar is probably the easiest way to find related literature. The most relevant articles tend to be published in very good journals. A very subjective and certainly incomplete list of decent journals (in my field) is the following: American Economic Review, Econometrica, Review of Economic Studies, Journal of Political Economy, Quarterly Journal of Economics, Journal of Economic Theory, Theoretical Economics, RAND Journal of Economics, Games and Economic Behavior, Economic Journal, Journal of the European Economic Association, International Economic Review
<ul class="org-ul">
<li>to be able to download academic papers without having to pay for it, you have to be either on campus or connect to the university via VPN</li>
</ul></li>
<li>Have a conclusion.</li>
<li>You do yourself (and your readers!) a favor if you write in LaTeX (and use BibTeX).</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">5</span> Some general remarks</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Keep in mind that a model is a conscious over-simplification of reality. If you want to analyze a certain problem, it is usually not helpful to try to stack everything you have heard about this problem in one model (and then make it dynamic in continuous time etc.). Such models tend to be intractable and therefore absolutely useless. Focus on some specific aspect/effect and try to get the smallest possible model in which you can see the effect. You can generalize later on if you like.</li>
<li>Your thesis can contain several small models if you want to explain several effects. There is no need to stack everything into one grand model, see above.</li>
<li>You should reserve a decent amount of time at the end for editing only. For a master thesis I would recommend no less than two weeks. Part of the evaluation of a thesis is that it is well written.</li>
<li>You have to write in English.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">6</span> Useful sources for how to write/model</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Hal Varian's "How to build an economic model in your spare time", <a href="http://people.ischool.berkeley.edu/~hal/Papers/how.pdf">link</a></li>
<li>The faculty's policy on MSc supervision, <a href="http://econ.ku.dk/schottmueller/teaching/supervision/Use_Your_Master_Thesis_Supervisor.pdf">link</a></li>
<li>My colleague Christian Groth has written down some excellent <a href="http://www.econ.ku.dk/okocg/Forside/Advice%20for%20writing%20a%20BA%20or%20MA%20thesis.htm">advice</a> for finding a thesis topic and writing a thesis. He also gives more links on where to get even more advice on how to write.</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Switching to this format can be an option if you cannot manage to get anything sensible out of a model (thesis type: start from a published paper) but you have read the related papers so well that you have a clear idea of the literature. 
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
 <p>author: Christoph Schottmueller <br> license: Creative Commons Attribution ShareAlike 4.0</p>
</div>
</body>
</html>
